apache/nuttx/arch/arm/src/common/stm32/stm32_pulsecount.c
/****************************************************************************
 * arch/arm/src/common/stm32/stm32_pulsecount.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <inttypes.h>
#include <stdint.h>
#include <stdio.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <nuttx/arch.h>
#include <arch/board/board.h>

#include "arm_internal.h"
#include "chip.h"
#include "stm32_pulsecount.h"
#include "stm32.h"
#include "stm32_tim.h"

/* Generalized pulse count support for all STM32 families */

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Timer Definitions ********************************************************/

/* Pulsecount is supported by advanced timers only. */

#define TIMTYPE_ADVANCED  5
#define TIMTYPE_TIM1      TIMTYPE_ADVANCED
#define TIMTYPE_TIM8      TIMTYPE_ADVANCED

/* Advanced timer clock source, RCC EN offset, enable bit,
 * RCC RST offset, reset bit to use
 */

#define TIMCLK_TIM1      STM32_TIM1_CLKIN
#define TIMRCCEN_TIM1    STM32_RCC_APB2ENR
#define TIMEN_TIM1       RCC_APB2ENR_TIM1EN
#define TIMRCCRST_TIM1   STM32_RCC_APB2RSTR
#define TIMRST_TIM1      RCC_APB2RSTR_TIM1RST
#define TIMCLK_TIM8      STM32_TIM8_CLKIN
#define TIMRCCEN_TIM8    STM32_RCC_APB2ENR
#define TIMEN_TIM8       RCC_APB2ENR_TIM8EN
#define TIMRCCRST_TIM8   STM32_RCC_APB2RSTR
#define TIMRST_TIM8      RCC_APB2RSTR_TIM8RST

/* The TIM1/TIM8 update-event interrupt vector is named differently across
 * families. This will be unified later.
 */

#if defined(STM32_IRQ_TIM1UP)
#  define PULSECOUNT_TIM1_IRQ  STM32_IRQ_TIM1UP
#elif defined(STM32_IRQ_TIM1_UP)
#  define PULSECOUNT_TIM1_IRQ  STM32_IRQ_TIM1_UP
#elif defined(STM32_IRQ_TIM1_BRK)
#  define PULSECOUNT_TIM1_IRQ  STM32_IRQ_TIM1_BRK
#endif

#if defined(STM32_IRQ_TIM8UP)
#  define PULSECOUNT_TIM8_IRQ  STM32_IRQ_TIM8UP
#elif defined(STM32_IRQ_TIM8_UP)
#  define PULSECOUNT_TIM8_IRQ  STM32_IRQ_TIM8_UP
#endif

/* Default GPIO pins state */

#if defined(CONFIG_STM32_STM32F10XX)
#  define PINCFG_DEFAULT (GPIO_INPUT | GPIO_CNF_INFLOAT | GPIO_MODE_INPUT)
#else
#  define PINCFG_DEFAULT (GPIO_INPUT | GPIO_FLOAT)
#endif

#define PULSECOUNT_POL_NEG      1
#define PULSECOUNT_IDLE_ACTIVE  1

/* Debug ********************************************************************/

#ifdef CONFIG_DEBUG_TIMER_INFO
#  define pulsecount_dumpgpio(p,m) stm32_dumpgpio(p,m)
#else
#  define pulsecount_dumpgpio(p,m)
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Pulsecount output configuration */

struct stm32_out_s
{
  uint8_t  in_use:1;
  uint8_t  pol:1;
  uint8_t  idle:1;
  uint8_t  _res:5;
  uint32_t pincfg;
};

/* Pulsecount channel configuration */

struct stm32_chan_s
{
  uint8_t            channel;
  struct stm32_out_s out1;
};

/* This structure represents the state of one pulsecount timer */

struct stm32_tim_s
{
  struct stm32_chan_s  channel;
  uint8_t              timid:5;
  uint8_t              timtype:3;
  uint8_t              t_dts:3;
  uint8_t              _res:5;
  uint8_t              irq;
  uint8_t              prev;
  uint8_t              curr;
  uint32_t             count;
  uint32_t             frequency;
  uint32_t             base;
  uint32_t             pclk;
  void                *handle;
};

struct stm32_pulsecount_s
{
  const struct pulsecount_ops_s *ops;
  struct stm32_tim_s *timer;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register access */

static uint32_t pulsecount_getreg(struct stm32_tim_s *priv, int offset);
static void pulsecount_putreg(struct stm32_tim_s *priv, int offset,
                              uint32_t value);
static void pulsecount_modifyreg(struct stm32_tim_s *priv, uint32_t offset,
                                 uint32_t clearbits, uint32_t setbits);

#ifdef CONFIG_DEBUG_TIMER_INFO
static void pulsecount_dumpregs(struct pulsecount_lowerhalf_s *dev,
                                const char *msg);
#else
#  define pulsecount_dumpregs(priv,msg)
#endif

/* Timer management */

static int pulsecount_ccr_update(struct pulsecount_lowerhalf_s *dev,
                                 uint8_t index, uint32_t ccr);
static int pulsecount_duty_update(struct pulsecount_lowerhalf_s *dev,
                                  uint8_t channel, ub16_t duty);
static int pulsecount_frequency_update(struct pulsecount_lowerhalf_s *dev,
                                       uint32_t frequency);
static int pulsecount_timer_configure(struct stm32_tim_s *priv);
static int pulsecount_channel_configure(struct pulsecount_lowerhalf_s *dev,
                                        uint8_t channel);
static int pulsecount_output_configure(struct stm32_tim_s *priv,
                                       struct stm32_chan_s *chan);
static int pulsecount_outputs_enable(struct pulsecount_lowerhalf_s *dev,
                                     uint16_t outputs, bool state);
static void pulsecount_moe_enable(struct pulsecount_lowerhalf_s *dev,
                                  bool enable);
static int pulsecount_configure(struct pulsecount_lowerhalf_s *dev);
static int pulsecount_timer(struct pulsecount_lowerhalf_s *dev,
                            const struct pulsecount_info_s *info);
static int pulsecount_interrupt(struct pulsecount_lowerhalf_s *dev);
#  ifdef CONFIG_STM32_TIM1_PULSECOUNT
static int pulsecount_tim1interrupt(int irq, void *context, void *arg);
#  endif
#  ifdef CONFIG_STM32_TIM8_PULSECOUNT
static int pulsecount_tim8interrupt(int irq, void *context, void *arg);
#  endif
static uint8_t pulsecount_count(uint32_t count);

/* Pulsecount driver methods */

