apache/nuttx/arch/arm/src/common/stm32/stm32_pulsecount.c
  channel = priv->channel.channel;

  if (channel != 0 && (selected == 0 || channel == selected) &&
      priv->channel.out1.in_use == 1)
    {
      outputs = (1 << ((channel - 1) * 2));
    }

  return outputs;
}

/****************************************************************************
 * Name: pulsecount_configure
 *
 * Description:
 *   Configure pulsecount timer in PULSECOUNT mode
 *
 ****************************************************************************/

static int pulsecount_configure(struct pulsecount_lowerhalf_s *dev)
{
  struct stm32_tim_s *priv = (struct stm32_tim_s *)dev;
  uint16_t outputs = 0;
  int     ret      = OK;

  /* NOTE: leave timer counter disabled and all outputs disabled! */

  /* Disable the timer until we get it configured */

  pulsecount_modifyreg(priv, STM32_GTIM_CR1_OFFSET, GTIM_CR1_CEN, 0);

  /* Get configured outputs */

  outputs = pulsecount_outputs_from_channels(priv, 0);

  /* Disable configured outputs before the timer is reconfigured. */

  ret = pulsecount_outputs_enable(dev, outputs, false);
  if (ret < 0)
    {
      goto errout;
    }

  /* Initial timer configuration */

  ret = pulsecount_timer_configure(priv);
  if (ret < 0)
    {
      goto errout;
    }

  /* Disable software break (enable outputs) */

  pulsecount_moe_enable(dev, true);

  /* Configure timer channels */

  if (priv->channel.channel != 0)
    {
      pulsecount_channel_configure(dev, priv->channel.channel);
      pulsecount_output_configure(priv, &priv->channel);
    }

errout:
  return ret;
}

/****************************************************************************
 * Name: pulsecount_timer
 *
 * Description:
 *   (Re-)initialize the timer resources and start the pulsed output
 *
 * Input Parameters:
 *   dev  - A reference to the lower half pulsecount driver state structure
 *   info - A reference to the characteristics of the pulsed output
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 * This split keeps pulsecount as the existing single-channel mode.
 *
 ****************************************************************************/

static int pulsecount_timer(struct pulsecount_lowerhalf_s *dev,
                            const struct pulsecount_info_s *info)
{
  struct stm32_tim_s *priv = (struct stm32_tim_s *)dev;
  ub16_t    duty    = 0;
  uint8_t   channel = 0;
  uint16_t  outputs = 0;
  int       ret     = OK;

  /* If we got here then the timer instance supports pulsecount output. */

  DEBUGASSERT(priv != NULL && info != NULL);

  _info("TIM%u channel: %u high: %" PRIu32 " ns low: %" PRIu32
          " ns count: %" PRIu32 "\n",
          priv->timid, priv->channel.channel, info->high_ns,
          info->low_ns, info->count);

  DEBUGASSERT(pulsecount_frequency(info) > 0);

  /* Channel specific setup */

  duty    = pulsecount_duty(info);
  channel = priv->channel.channel;

  /* Disable all interrupts and DMA requests, clear all pending status */

  pulsecount_putreg(priv, STM32_GTIM_DIER_OFFSET, 0);
  pulsecount_putreg(priv, STM32_GTIM_SR_OFFSET, 0);

  /* Set timer frequency */

  ret = pulsecount_frequency_update(dev, pulsecount_frequency(info));
  if (ret < 0)
    {
      goto errout;
    }

  /* Update duty cycle */

  ret = pulsecount_duty_update(dev, channel, duty);
  if (ret < 0)
    {
      goto errout;
    }

  /* If a non-zero repetition count has been selected, then set the
   * repetition counter to the count-1 (pulsecount_start() has already
   * assured us that the count value is within range).
   */

  if (info->count > 0)
    {
      /* Save the remaining count and the number of counts that will have
       * elapsed on the first interrupt.
       */

      /* If the first interrupt occurs at the end end of the first
       * repetition count, then the count will be the same as the RCR
       * value.
       */

      priv->prev  = pulsecount_count(info->count);
      pulsecount_putreg(priv, STM32_ATIM_RCR_OFFSET, priv->prev - 1);

      /* Generate an update event to reload the prescaler.  This should
       * preload the RCR into active repetition counter.
       */

      pulsecount_putreg(priv, STM32_GTIM_EGR_OFFSET, GTIM_EGR_UG);

      /* Now set the value of the RCR that will be loaded on the next
       * update event.
       */

      priv->count = info->count;
      priv->curr  = pulsecount_count(info->count - priv->prev);
      pulsecount_putreg(priv, STM32_ATIM_RCR_OFFSET, priv->curr - 1);
    }

  /* Otherwise, just clear the repetition counter */

  else
    {
      /* Set the repetition counter to zero */

      pulsecount_putreg(priv, STM32_ATIM_RCR_OFFSET, 0);

      /* Generate an update event to reload the prescaler */

      pulsecount_putreg(priv, STM32_GTIM_EGR_OFFSET, GTIM_EGR_UG);
    }

  /* Get configured outputs */

  outputs = pulsecount_outputs_from_channels(priv, channel);

  /* Enable output */

  ret = pulsecount_outputs_enable(dev, outputs, true);
  if (ret < 0)
    {
      goto errout;
    }

  /* Setup update interrupt. If info->count is > 0, then we can
   * be assured that pulsecount_start() has already verified: (1) that
   * this is an advanced timer, and that (2) the repetition count is within
   * range.
   */

  if (info->count > 0)
    {
      /* Clear all pending interrupts and enable the update interrupt. */

      pulsecount_putreg(priv, STM32_GTIM_SR_OFFSET, 0);
      pulsecount_putreg(priv, STM32_GTIM_DIER_OFFSET, GTIM_DIER_UIE);

      /* Enable the timer */

      pulsecount_modifyreg(priv, STM32_GTIM_CR1_OFFSET, 0, GTIM_CR1_CEN);

      /* And enable timer interrupts at the NVIC */

      up_enable_irq(priv->irq);
    }

  pulsecount_dumpregs(dev, "After starting");

errout:
  return ret;
}

/****************************************************************************
 * Name: pulsecount_interrupt
 *
 * Description:
 *   Handle timer interrupts.
 *
 * Input Parameters:
 *   dev - A reference to the lower half pulsecount driver state structure
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int pulsecount_interrupt(struct pulsecount_lowerhalf_s *dev)
{
  struct stm32_tim_s *priv = (struct stm32_tim_s *)dev;
  uint16_t regval;

